# Задания 19–21 — Теория игр

[← Назад ко всем заданиям](../../README.md)

**Теги:** Python · Рекурсия · Теория игр · any() · all()

---

## 📥 Скачать материалы

| Файл | Описание | Ссылка |
|:---|:---|:---:|
| 📄 Лекция (Word) | Полная текстовая лекция с разбором всех типов | [Скачать](./files/task19_lecture.docx) |
| 📊 Презентация (PowerPoint) | 8 слайдов с визуализацией алгоритма | [Скачать](./files/task19_presentation.pptx) |

> 💡 Чтобы скачать файл на GitHub — нажми на ссылку, затем кнопку **Download** (или иконку ⬇️ справа вверху).

---

## О задании

Задания 19–21 посвящены **теории игр** и анализу стратегий.

- Описание игры — в задании **19**, задания **20** и **21** дополняют его
- Два игрока: **Петя** (первый) и **Ваня** (второй)
- Добавляют (или убирают) камни из кучи (куч) по очереди
- Победитель — тот, на чьём ходу количество камней достигает предела

**Требуется:** найти начальное количество камней, при котором побеждает нужный игрок.

---

## Содержание

| Раздел | Тема |
|:---:|:---|
| 1 | Краткий обзор теории игр |
| 2 | Алгоритм решения — рекурсивная функция |
| 3 | Тип 1 — одна куча камней |
| 4 | Тип 2 — две кучи камней |
| 5 | Шаблон кода |

---

## 1. Краткий обзор теории игр

| Понятие | Определение |
|:---|:---|
| **Игра с нулевой суммой** | Выигрыш одной стороны = проигрыш другой |
| **Win-win стратегия** | Оба участника в выигрыше за счёт сотрудничества |
| **Равновесие Нэша** | Ни один игрок не может улучшить результат, изменив только свою стратегию |
| **Выигрышная стратегия** | Гарантирует победу независимо от ходов противника |
| **Дерево решений** | Граф всех возможных ходов игры |

> 💡 **Дилемма заключённого:** хотя молчать выгодно обоим, каждый рационально выбирает сдать. Это равновесие Нэша — рациональное поведение ведёт к нерациональному исходу для группы.

---

## 2. Алгоритм решения

В основе решения — **рекурсивная функция** `f(s, m)`:

- `s` — текущее количество камней
- `m` — количество оставшихся ходов до конца

### Что проверяет каждое задание

| Задание | Кто побеждает | Ход | Параметр m |
|:---:|:---|:---:|:---:|
| **19** | Ваня первым ходом | 2-й | `f(s, 2)` |
| **20** | Петя вторым ходом | 3-й | `f(s, 3) and not f(s, 1)` |
| **21** | Ваня первым или вторым | 4-й | `f(s, 4) and not f(s, 2)` |

### Ключевое правило: any() и all()

```
any(h) — хватит хотя бы одного победного исхода → для хода ВАНИ
all(h) — все ходы должны вести к победе        → для хода ПЕТИ
```

---

## 3. Тип 1 — Одна куча камней

### Универсальная функция

```python
def f(s, m):
    # Условие победы — подставь свой предел
    if s >= 51:
        return m % 2 == 0  # чётный ход = ход Вани = победа Вани

    # Ходы закончились
    if m == 0:
        return False

    # Все возможные ходы — подставь свои операции
    h = [f(s + 1, m - 1),   # операция 1: +1
         f(s + 4, m - 1),   # операция 2: +4
         f(s * 2, m - 1)]   # операция 3: ×2

    # any для Вани, all для Пети
    return any(h) if (m + 1) % 2 == 0 else all(h)


# Задание 19
print('19:', *[s for s in range(1, 51) if f(s, 2)])

# Задание 20
print('20:', *[s for s in range(1, 51) if f(s, 3) and not f(s, 1)])

# Задание 21
print('21:', min([s for s in range(1, 51) if f(s, 4) and not f(s, 2)]))
```

### Пример с убыванием камней (-2, -5, //3)

```python
def f(s, m):
    if s <= 19:              # победа при s <= 19
        return m % 2 == 0
    if m == 0:
        return False
    h = [f(s - 2, m - 1),   # -2
         f(s - 5, m - 1),   # -5
         f(s // 3, m - 1)]  # //3 (целочисленное деление)
    return any(h) if (m + 1) % 2 == 0 else all(h)

print('19:', min([s for s in range(20, 100) if f(s, 2)]))
print('20:', *[s for s in range(20, 100) if f(s, 3) and not f(s, 1)])
print('21:', *[s for s in range(20, 100) if f(s, 4) and not f(s, 2)])
```

---

## 4. Тип 2 — Две кучи камней

> ⚠️ **Особенность задания 19 с двумя кучами:** формулировка «Ваня выиграл после **неудачного** хода Пети» означает — достаточно хотя бы одного неудачного хода. Для задания 19 убираем `all()`, оставляем только `any()`. Для заданий 20–21 возвращаем стандартную проверку.

```python
def f(s1, s2, m):
    if s1 + s2 >= 81:        # победа при сумме >= 81
        return m % 2 == 0
    if m == 0:
        return False

    # Каждую операцию применяем к каждой из двух куч
    h = [f(s1 + 1, s2, m - 1),  # +1 к первой куче
         f(s1, s2 + 1, m - 1),  # +1 ко второй куче
         f(s1 * 2, s2, m - 1),  # ×2 первую кучу
         f(s1, s2 * 2, m - 1)]  # ×2 вторую кучу

    # Для задания 19 (неудачный ход Пети):
    return any(h)

    # Для заданий 20–21 раскомментировать:
    # return any(h) if (m + 1) % 2 == 0 else all(h)


# Задание 19 (первая куча = 7 камней)
print('19:', min([s for s in range(1, 74) if f(7, s, 2)]))

# Задания 20–21 (используй версию с any/all выше)
print('20:', *[s for s in range(1, 74) if f(7, s, 3) and not f(7, s, 1)])
print('21:', min([s for s in range(1, 74) if f(7, s, 4) and not f(7, s, 2)]))
```

---

## 5. Шаблон — алгоритм по шагам

| # | Шаг | Что делать |
|:---:|:---|:---|
| 1 | Прочитать условие | Сколько куч? Какие операции? Каков предел? |
| 2 | Написать `f()` | Аргументы: `s, m` или `s1, s2, m` |
| 3 | Условие победы | `if s >= предел: return m % 2 == 0` |
| 4 | Список ходов `h` | Рекурсивный вызов с `m-1` для каждой операции |
| 5 | Возврат | `any(h)` для Вани, `all(h)` для Пети |
| 6 | Задание 19 | `f(s, 2)` |
| 7 | Задание 20 | `f(s, 3) and not f(s, 1)` |
| 8 | Задание 21 | `f(s, 4) and not f(s, 2)` |
